&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    Если ЗначениеЗаполнено(Объект.ФизическоеЛицо) Тогда
        Объект.Наименование = Объект.ФизическоеЛицо.Наименование;
        Если НЕ ЗначениеЗаполнено(Объект.КонтактныйТелефон) Тогда
            Объект.КонтактныйТелефон = Объект.ФизическоеЛицо.КонтактныйТелефон;
        КонецЕсли;
    КонецЕсли;
КонецПроцедуры     

&НаКлиенте
Процедура ФизическоеЛицоНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
    СтандартнаяОбработка = Ложь;
    ПараметрыОтбора = Новый Структура;
    ПараметрыОтбора.Вставить("Наименование", "");
    ФормаВыбора = ПолучитьФорму("Справочник.ФизическиеЛица.ФормаВыбора", ПараметрыОтбора, Элемент);
    ФормаВыбора.Открыть();
КонецПроцедуры