
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	//{{_КОНСТРУКТОР_ПЕЧАТИ(ПечатьПропуска)
	ТабДок = Новый ТабличныйДокумент;
	ПечатьПропуска(ТабДок, ПараметрКоманды);

	ТабДок.ОтображатьСетку = Ложь;
	ТабДок.Защита = Ложь;
	ТабДок.ТолькоПросмотр = Ложь;
	ТабДок.ОтображатьЗаголовки = Ложь;
	ТабДок.Показать();
	//}}
КонецПроцедуры

&НаСервере
Процедура ПечатьПропуска(ТабДок, ПараметрКоманды)
	Документы.ВыдачаПропуска.ПечатьПропуска(ТабДок, ПараметрКоманды);
КонецПроцедуры
