 &НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
    
    // Проверяем, является ли пользователь администратором
    ЭтоАдминистратор = Пользователи.РолиДоступны("Администратор")
                       Или Пользователи.РолиДоступны("ПолныеПрава");
    Если Не ЭтоАдминистратор Тогда
        Сообщить(НСтр("ru = 'Доступ к списку всех задач разрешен только администраторам.'", "ru"));
        Отказ = Истина;
        Возврат;
    КонецЕсли;
    
    Элементы.ТаблицаЗадач.Данные = ПолучитьСписокЗадач();
    
КонецПроцедуры

&НаСервере
Функция ПолучитьСписокЗадач()
    
    Запрос = Новый Запрос;
    Запрос.Текст =  "ВЫБРАТЬ
                    |	ЗадачаИсполнителя.Ссылка КАК Ссылка,
                    |	ЗадачаИсполнителя.БизнесПроцесс КАК БизнесПроцесс,
                    |	ЗадачаИсполнителя.РольИсполнителя КАК РольИсполнителя,
                    |	ЗадачаИсполнителя.Дата КАК Дата,
                    |	ЗадачаИсполнителя.ТочкаМаршрута КАК ТочкаМаршрута,
                    |	ЗадачаИсполнителя.Наименование КАК Наименование
                    |ИЗ
                    |	Задача.ЗадачаИсполнителя КАК ЗадачаИсполнителя";
        
    Возврат Запрос.Выполнить().Выгрузить();
    
КонецФункции