Процедура ПечатьПропуска(ТабДок, Ссылка) Экспорт
    Макет = Документы.ВыдачаПропускаНаТС.ПолучитьМакет("ПечатнаяФормаПропуска");
    Запрос = Новый Запрос;
    Запрос.Текст =
    "ВЫБРАТЬ
    |	ВыдачаПропускаНаТС.Заявка.РежимноеПомещение КАК РежимноеПомещение,
    |	ВыдачаПропускаНаТС.Заявка.Номер КАК Номер,
    |	ВыдачаПропускаНаТС.Дата КАК Дата,
    |	ВыдачаПропускаНаТС.ДатаВыдачи КАК ДатаВыдачи,
    |	ВыдачаПропускаНаТС.ДатаОкончания КАК ДатаОкончания,
    |	ВыдачаПропускаНаТС.Инициатор КАК Инициатор,
    |	ВыдачаПропускаНаТС.ФизическоеЛицо КАК ФизическоеЛицо,
    |	ВыдачаПропускаНаТС.ПричинаПосещения КАК ПричинаПосещения,
    |	ВыдачаПропускаНаТС.ТипПропуска КАК ТипПропуска,
    |	ВыдачаПропускаНаТС.ЗонаДоступа КАК ЗонаДоступа,
    |	ВыдачаПропускаНаТС.ТочкаКонтроля КАК ТочкаКонтроля,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство КАК ТранспортноеСредство,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.НомерТС КАК НомерТС,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.Марка КАК Марка,
    |	ЗаявкаНаВъездТС.ТранспортноеСредство.Модель КАК Модель
    |ИЗ
    |	Документ.ВыдачаПропускаНаТС КАК ВыдачаПропускаНаТС
    |		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ЗаявкаНаВъездТС КАК ЗаявкаНаВъездТС
    |		ПО ВыдачаПропускаНаТС.Заявка = ЗаявкаНаВъездТС.Ссылка
    |ГДЕ
    |	ВыдачаПропускаНаТС.Ссылка В(&Ссылка)";
    Запрос.Параметры.Вставить("Ссылка", Ссылка);
    Выборка = Запрос.Выполнить().Выбрать();

    Заголовок = Макет.ПолучитьОбласть("Заголовок");
    Шапка = Макет.ПолучитьОбласть("Шапка");
    ТабДок.Очистить();

    ВставлятьРазделительСтраниц = Ложь;
    Пока Выборка.Следующий() Цикл
        Если ВставлятьРазделительСтраниц Тогда
            ТабДок.ВывестиГоризонтальныйРазделительСтраниц();
        КонецЕсли; 
		
		// форматирование дат
		Заголовок.Параметры.Дата = Формат(Выборка.Дата, "ДЛФ=DD");
        Шапка.Параметры.ДатаВыдачи = Формат(Выборка.ДатаВыдачи, "ДЛФ=DD");
        Шапка.Параметры.ДатаОкончания = Формат(Выборка.ДатаОкончания, "ДЛФ=DD");

        // Заполнение параметров
		Заголовок.Параметры.РежимноеПомещение = Выборка.РежимноеПомещение;
		Заголовок.Параметры.Номер = Выборка.Номер;
        Заголовок.Параметры.ТипПропуска = Выборка.ТипПропуска;

        Шапка.Параметры.ЗонаДоступа = Выборка.ЗонаДоступа;
        Шапка.Параметры.Инициатор = Выборка.Инициатор;
        Шапка.Параметры.ФизическоеЛицо = Выборка.ФизическоеЛицо;
        Шапка.Параметры.ПричинаПосещения = Выборка.ПричинаПосещения;
        Шапка.Параметры.ТочкаКонтроля = Выборка.ТочкаКонтроля; 
		Шапка.Параметры.Марка = Выборка.Марка;
		Шапка.Параметры.Модель = Выборка.Модель;
		Шапка.Параметры.НомерТС = Выборка.НомерТС;
		
		ТабДок.Вывести(Заголовок, Выборка.Уровень());
        ТабДок.Вывести(Шапка, Выборка.Уровень());
		
		ВставлятьРазделительСтраниц = Истина;
    КонецЦикла;
		
    // Настройка отображения
    ТабДок.АвтоМасштаб = Истина;
    ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Портрет;
    ТабДок.ТолькоПросмотр = Истина;
КонецПроцедуры